{
    "card.angular.content": "Until recently, my favorite JS frameworks / libraries. I made a few mini projects in it and I like it, that a lot of functionality is natively supplied with TypeScript",
    "card.angular.description": "Framework and platform for creating SPA, written in the TypeScript language",
    "card.angular.title": "Angular",
    "card.antd.content": "I know well and often use as in both business and private projects",
    "card.antd.description": "The React.js library contains a set of useful components to help you create a graphical interface",
    "card.antd.title": "Ant Design - React",
    "card.bootstrap.content": "The last one I use less often, but I know most of the basic components + of course grid",
    "card.bootstrap.description": "The CSS library contains a set of useful tools to help you create a graphical interface",
    "card.bootstrap.title": "Bootstrap",
    "card.css.content": "In css I do not recall the thing that I would not do, everything is a matter of time. When it comes to particulars, I know: positioning, flex, transition, transform, animation and of course more basic functions. I never used grid.",
    "card.css.description": "It is used to describe the form of web page presentation",
    "card.css.title": "CSS3",
    "card.git.content": "At first, I used commands from the terminal, but with time I moved to the Intelli-Interface (especially useful in conflicts). With both approaches, I have never encountered greater difficulties.",
    "card.git.description": "Version control system, especially useful for group work",
    "card.git.title": "Git",
    "card.html.content": "Nothing special just a set of tags, which in the vast majority I know together with their attributes.",
    "card.html.description": "Marker language",
    "card.html.title": "HTML5",
    "card.java.content": "I know the basic level, when it comes to adding functionalities, my knowledge is based on copy + paste from other code snippets, but I have no problem reading the code associated with the REST API",
    "card.java.description": "Class-based object-oriented programming language for general use",
    "card.java.title": "Java",
    "card.javaScript.content": "I mastered JS in a stupa enabling the creation of advanced functionalities. In addition to JS, I also know such libraries as lodash, moment.js or jQuery, although I would prefer not to use the latter.",
    "card.javaScript.description": "The programming language used on websites",
    "card.javaScript.es6.content": "I know all the used ES6 functions so much that I do not like using the ES5 syntax anymore",
    "card.javaScript.es6.description": "Otherwise called ECMAScript2015, JS stardard",
    "card.javaScript.es6.title": "JavaScript ES6",
    "card.javaScript.title": "JavaScript",
    "card.jest.content": "Useful, pleasant, simple (although not from the beginning)",
    "card.jest.description": "JavaScript Testing Framework with an emphasis on simplicity",
    "card.jest.title": "Jest",
    "card.liqui.base.content": "Content Liquibase",
    "card.liqui.base.description": "Database-independent library for tracking, managing and applying database schema changes",
    "card.liqui.base.title": "Liquibase",
    "card.react.content": "I love to create a lot of small, simple, generic components, which later create larger components, etc. React.js has become my favorite library / framer since the version with hooks.",
    "card.react.description": "JavaScript library, which is used to create graphical interfaces of the application.",
    "card.react.native.content": "After getting to know this technology, I am not convinced of it, theoretically it is a react, but sometimes doing a simple thing is extremely complicated. In brief, I know the basics, but I do not like using it.",
    "card.react.native.description": "Mobile application framework for building graphical interfarts",
    "card.react.native.title": "React-Native",
    "card.react.title": "React.js",
    "card.react.ts.content": "React without typing would be a heavy management, which is why I think TypeScript in React is an indispensable element",
    "card.react.ts.description": "The combination of both technologies allows greater clarity of the code and avoids the mass of errors already at the code production stage",
    "card.react.ts.title": "React + TypeScript",
    "card.rwd.content": "The most interesting thing from sass / css, (except maybe for all kinds of animations). Sometimes it seems to me that I am too much for the creation of a fully responsive view.",
    "card.rwd.description": "The technique of page design, so that the layout automatically adjusts to the size of the browser window",
    "card.rwd.title": "Responsive Web Design",
    "card.sass.content": "In scss I know variables, nesting + syntax, placeholders and maxins. I have not needed any more functionalities so far and I do not think they need them. As for Sass, I do not like the approach without braces and semicolons",
    "card.sass.description": "Sass is a preprocessor scripting language that is compiled into CSS",
    "card.sass.title": "SASS/SCSS",
    "card.sql.content": "I can create basic CRUD scripts in XML and SQL",
    "card.sql.description": "Structured text of queries used to create, modify databases and retrieve data from databases",
    "card.sql.title": "SQL",
    "card.typeScript.content": "My favorite feature JS, I type, I create interfaces, declare the types I can only get and I hate the type 'any', all the way to make the code self-documenting and clear.",
    "card.typeScript.description": "It allows optional static typing",
    "card.typeScript.title": "TypeScript",
    "card.vue.content": "I used Vue.js for one project using CLI and smaller pairs using CDN. I like the mix of Angular and React",
    "card.vue.description": "JavaScript framework for building user interfaces",
    "card.vue.title": "Vue.js",
    "card.webpack.content": "From project to project, each configuration is getting faster and faster, although I still have to search for everything after the documentation.",
    "card.webpack.description": "It is a module bundler primarily for JavaScript",
    "card.webpack.title": "Webpack",
    "common.subpage.under.construction": "Subpage under construction",
    "common.to.now": " to now",
    "experience.content": "Pentacomp Systemy informatyczne S.A.",
    "footer": "Made by ",
    "home.sub.title": "I'm a front-end developer at Escola Sp. z o.o",
    "home.title": "Hi, I'm Przemek",
    "nav.contact": "Contact",
    "nav.experience": "Experience",
    "nav.home": "Home",
    "nav.progress": "My progress",
    "nav.projects": "Projects",
    "progress.1": "My first contact with the frontend",
    "progress.2": "First steps in HTML5 and CSS3",
    "progress.3": "My first mini projects using HTML5 and CSS3",
    "progress.4": "First steps in CSS framework - Bootstrap",
    "progress.5": "Course organized by ALX: \"Tworzenie stron WWW\", where I developed my skills with HTML5, CSS3, Bootstrap, and learned the basics of JavaScript and Responsive Web Design",
    "progress.6": "I'm starting to learn online courses such as codeacademy or freeCodeCamp",
    "progress.7": "First steps in jQuery",
    "progress.8": "I'm starting to create more advanced mini projects using HTML5, CSS3, RWD, jQuery",
    "progress.9": "Kodilla Bootcamp, where I develop my previous skills and get to know SASS / SCSS, Git and more advanced JavaScript. During the course I create about 10 mini projects Photoshop => HTML, all of these projects are fully responsive",
    "progress.10": "I'm starting to get a job as a front-end developer",
    "progress.11": "I'm starting to experiment with JavaScript frameworks: React.js and Angular.js, but I'm not doing well and I deside to focus on vanilla JavaScript",
    "progress.12": "Focusing on JavaScript, it solves dozens of non-hundreds of smaller and larger tasks on codewars website",
    "progress.13": "When solving tasks for Codewars, I begin to use ES6 syntax",
    "progress.14": "My first mini commercial project, the so-called \"landing page\"",
    "progress.15": "I'm buying my first courses in the Udemy website (with time there will be quite a lot of them)",
    "progress.16": "I have a lot of job interviews",
    "progress.17": "I have a job interview at Pentacomp Systemy Informatyczne S.A.",
    "progress.18": "I get feedback from Pentacomp, that I have successfully passed the recruitment process and after agreeing on the terms of the contract, I agree to establish cooperation as a Front-end developer",
    "progress.19": "My first day at Pentacomp",
    "progress.20": "I join the Java team that recently started to implement the project for Bank BGŻ BNP Paribas under the name ILegal, providing a workflow for bank lawyers. My main task is stylization of the project.",
    "progress.21": "I am a co-presenter of the presentation entitled 'Angular vs React vs Vue', my part is a part of Angular and Vue",
    "progress.22": "Together with the team, we join another team and jointly implement the LIMS project. This application is to provide workflow for GIOS employees in the matter of testing water samples. It uses such front-end technologies as React.js and TypeScript",
    "progress.23": "TypeScript is becoming my favorite JavaScript feature",
    "progress.24": "I'm starting to write first functionalities in Java and scripts in Liquibase",
    "progress.25": "Together with the team, we are launching the project of the Surface Water Quality Portal. It is supposed to be a widely available application and should contain a CIEP publication on water quality in Poland. The application will use front-end technology such as React.js, TypeScript and React-Native.",
    "progress.26": "I get to know React Hooks, in which I see a giant sub-podium. I also propagate knowledge in a team and introduce changes to the PJWP project",
    "progress.27": "Correction of WCAG 2.0 errors after an audit by the Fundacja Widzialni for the PJWP project.",
    "progress.28": "Obtaining the \"Site Without Barriers\" certificate from the Visible Foundation. It gives me tremendous satisfaction, because it is 100% my work and makes me realize that on the front-end I am able to do everything.",
    "progress.29": "Together with the team, we are starting the implementation of the SPWD MX project - this is a sub module of a larger project for the Warsaw City Guard aimed at administering and collecting information from other modules. There is also a project 100% using React Hooks.",
    "progress.30": "I significantly improve my work in TypeScript by creating much more Generally typed components. I am also starting to improve my skills in JEST tests, but the project is not too short to refine my skills",
    "progress.31": "While my team focuses on typical back-end projects, I am hired to another team to adapt the SPWD - Portal Mieszkańca project to WCAG requirements",
    "progress.32": "Together with the team, we take over a production project for Kozminski University, Kozminski University - Conclusions.",
    "progress.33": "Due to the fact that the application ALK - Conclusions is quite a complicated application and in addition it does not provide TypeScrit, I am pushing the idea in the team to change the configuration and rewrite the main components from JavaScript to TypeScript",
    "progress.34": "Implementation the client's request the development of ALK applications",
    "progress.35": "Implementation of 3 update packages for the BNP Paribas client for the Ilegal application",
    "progress.36": "Due to the fact that the Ilegal application is a typical back-end application, and at this time there are no other front-end orders for me, I am starting to write 100% Java code",
    "progress.37": "I am significantly improving my Java code reading and writing skills",
    "progress.38": "I am creating a \"Mock\" mobile application for the BPN Paribas client for the purposes of the presentation. It is a web application with a resolution adjusted to 360px width. Within 5 working days, I am able to create views: logins with different types of users, a list of cases for lawyers with filtering, and a screen for creating and editing a case.",
    "progress.39": "Implementation the client's request the development of Ilegal applications",
    "progress.40": "Implementation the client's request the development of ALK applications - creating additional 5 proposals",
    "progress.41": "Implementation the client's request the development of Ilegal applications - integration with an external system",
    "projects.card.image.alt.creative.project": "Creative Project, PSD => HTML",
    "projects.card.image.alt.game": "Game master mind",
    "projects.card.image.alt.hex.project": "Hex Project, PSD => HTML",
    "projects.card.image.alt.mobile.ninja": "Mobile Ninja, PSD => HTML",
    "projects.card.image.alt.photoapp": "Photo App, PSD => HTML",
    "projects.card.image.binary-clock": "Binary Clock",
    "projects.card.image.ilegal": "I-legal for BNP Paribas lawyers",
    "projects.card.image.lims": "Lims for CIoEP",
    "projects.card.image.pjwp": "SWQP for CIoEP",
    "projects.card.image.semaphore": "Railway signaling in Poland",
    "projects.card.image.todo-list-angular": "Todo List Angular 4",
    "projects.card.image.todo-list-vue": "Todo List Vue.js",
    "projects.card.image.zpwd-mx": "ZPWD-MX for the Warsaw city guard",
    "projects.card.link.full.code": "Full Code",
    "projects.card.link.live": "Live",
    "projects.card.technology.binary-clock": "HTML5 | CSS3 | JavaScript | ES6",
    "projects.card.technology.creative.project": "HTML5 | SCSS | CSS3 | Bootstrap | RWD | JavaScript | jQuery | NPM",
    "projects.card.technology.game": "HTML5 | CSS3 | SCSS | Bootstrap | RWD | Javascript | jQuery | NPM",
    "projects.card.technology.hex.project": "HTML5 | CSS3 | Bootstrap | RWD | jQuery",
    "projects.card.technology.ilegal": "HTML5 | SCSS | JavaScript | jQuery | Bootstrap | RWD | Java | Thymeleaf | SQL | Liquibase | Docker | Maven",
    "projects.card.technology.lims": "HTML5 | SCSS | JavaScript | ES6 | React.js | TypeScript | Antd | RWD | Java | SQL | Liquibase | Maven",
    "projects.card.technology.mobile.ninja": "html5 | CSS3 | FLEXBOX | Bootstrap | RWD | Javascript | jQuery | NPM",
    "projects.card.technology.photoapp": "HTML5 | SCSS | CSS3 | Bootstrap | RWD | NPM",
    "projects.card.technology.pjwp": "HTML5 | SCSS | JavaScript | ES6 | React.js | React Hooks | TypeScript | JEST | Antd | RWD | WCAG 2.0 | Java | SQL | Liquibase | Gradle",
    "projects.card.technology.semaphore": "HTML5 | Vue.js |        SCSS | Bootstrap | RWD | Javascript | NPM | Grunt",
    "projects.card.technology.todo-list-angular": "HTML5 | Angular 4 | TypeScript | SCSS | Bootstrap | RWD | Javascript | NPM | Webpack",
    "projects.card.technology.todo-list-vue": "HTML5 | Vue.js | Vue Cli | SCSS | Bootstrap | RWD | Javascript | NPM | Webpack",
    "projects.card.technology.zpwd-mx": "HTML5 | SCSS | JavaScript | ES6 | React.js | React Hooks | TypeScript | JEST | Antd | RWD | Java | SQL | Liquibase | Docker | Maven",
    "projects.card.title.technology": "Technology",
    "projects.header.not.publicly.avaible": "Commercial projects not publicly available",
    "projects.header.private.projects": "Private projects",
    "projects.header.publicly.avaible": "Publicly available commercial projects",
    "title.experience": "Experience",
    "title.technologies": "Known technologies / libraries",
    "title.technologies.beginner": "Basic knowledge of technology / libraries"
}