{
  "card.angular.content": "Jeszcze do niedawno mój faworyt frameworków/bibliotek JS. Zrobiłem w nim parę mini projektów i podoba mi się w nim, że dużo funcjonalności jest natywnie dostarczonych łącznie z TypeScriptem",
  "card.angular.description": "Framework i platforma do tworzenia SPA, napisany w języku TypeScript",
  "card.angular.title": "Angular",
  "card.antd.content": "Znam dobrzę i często stosuję jak w projektach zarówno służbowych jak i prywatnych",
  "card.antd.description": "Biblioteka React.js, zawiera zestaw przydatnych komponentów ułatwiających tworzenie interfejsu graficznego",
  "card.antd.title": "Ant Design - React",
  "card.bootstrap.content": "Ostatnie rzadziej przeze mnie stosowany, ale znam większośc podstawowych komponentów + oczywiście grid",
  "card.bootstrap.description": "Biblioteka CSS, zawiera zestaw przydatnych narzędzi ułatwiających tworzenie interfejsu graficznego",
  "card.bootstrap.title": "Bootstrap",
  "card.css.content": "W cssie nie przypominam sobie rzeczy której bym nie zrobił, wszystko jest kwestią czasu. Jeżeli chodzi o konkrety znam: pozycjonowanie, flexa, transition, transform, animacje i oczywiście bardziej podstawowę funcjonalności. Nigdy nie stosowałem grida.",
  "card.css.description": "Służy do opisu formy prezentacji stron WWW",
  "card.css.title": "CSS3",
  "card.git.content": "Z początku używałem komend z terminala, natomiast z czasem przeniosłem się na interface Intelija (szczególnie przydatny przy konfliktach). Przy obu podejściach nigdy nie natrafiłem na większe trudności.",
  "card.git.description": "System kontroli wersji, szególnie przydadny do pracy w grupie",
  "card.git.title": "Git",
  "card.html.content": "Nic specjalnego po prostu zestaw znaczników, które w zdecydowanej większości znam łącznie z ich atrybutami.",
  "card.html.description": "Jezyk znaczników",
  "card.html.title": "HTML5",
  "card.java.content": "Znam w stopniu podstawowym, jeżeli chodzi i dodawanie funcjonalności to moją wiedza opiera się raczej na copy + paste z innych wycinków kodu, natomiast nie mam problemu z odczytaniem kodu związanego z REST API",
  "card.java.description": "Oparty na klasach, obiektowy język programowania ogólnego zastosowania",
  "card.java.title": "Java",
  "card.javaScript.content": "JS opanowałem w stupniu umożliwiającym tworzenie zaawansowanych funkcjonalności. Oprócz samego                JS znam także takie biblioteki jak lodash, moment.js, czy jQuery, chociaż tego ostatniego już bym wolał nie używać.",
  "card.javaScript.description": "Język programowania stosowany na stronach internetowych",
  "card.javaScript.es6.content": "Znam wszystkie stosowane funcjonolności ES6 to tego stopnia, że nie lubie już stosować składni ES5",
  "card.javaScript.es6.description": "Inaczej zwany ECMAScript2015, stardard języka JS",
  "card.javaScript.es6.title": "JavaScript ES6",
  "card.javaScript.title": "JavaScript",
  "card.jest.content": "Przydatny, przyjemny, prosty (chociaż nie z początku)",
  "card.jest.description": "Framework JavaScriptu służący do testowania, z naciskiem na prostotę",
  "card.jest.title": "Jest",
  "card.liqui.base.content": "Umiem tworzyć podstawowe CRUDowe skrypty, w XMLu i SQLu",
  "card.liqui.base.description": "Biblioteka niezależna od bazy danych do śledzenia, zarządzania i stosowania zmian schematu bazy danych",
  "card.liqui.base.title": "Liquibase",
  "card.react.content": "Uwielbiam tworzyć dużo małych, prostych, generycznych komponentów, z których później tworzy się wiekszę komponenty itp. React.js stał się moją ulubioną biblioteką/framerowkiem od kiedy weszła wersja z hooksami.",
  "card.react.description": "Biblioteka JavaScriptu, która służy do tworzenia interfejsów graficznych aplikacji.",
  "card.react.native.content": "Po bliższym poznaniu tej technologii nie jestem do niej przekonany, teoretycznie jest to react, jednak czasem zrobienie prostej rzeczy jest niezmiernie skomplikowane. W skrócie znam podstawy, ale nie lubie go stosować.",
  "card.react.native.description": "Framework aplikacji mobilnych służący do budowania interfajsów graficznych",
  "card.react.native.title": "React-Native",
  "card.react.title": "React.js",
  "card.react.ts.content": "React bez typowania byłby ciężki zarządzania, dlatego uważam TypeScript w Reakcie to nieodzowny element",
  "card.react.ts.description": "Połączenie obu tych technologii pozwala na większą przejrzystość kody i uniknięciu masy błędów już na etapie wytwarzania kodu",
  "card.react.ts.title": "React + TypeScript",
  "card.rwd.content": "Najciekawszą rzecz z sass/css, (może z wyjątkiem różnego rodzaju animacji). Wydaję mi się czasem, że nawet za bardzo przykładam się to stworzenia w pełni responsywnego widoku.",
  "card.rwd.description": "Technika projektowania stron, tak aby układ dostosowywał się automatycznie do rozmiaru okna przeglądarki",
  "card.rwd.title": "Responsive Web Design",
  "card.sass.content": "W scssie znam zmienne, zagnieżdzenia + składnię, placeholdery i maxiny. Do tej pory więcej funcjonalności nie było mi potrzebne i nie wydaję mi się, żeby były one potrzebne. Co do Sassa nie lubie podejścia bez klamer i średników",
  "card.sass.description": "Sass to preprocesorowy język skryptowy skompilowany do CSS",
  "card.sass.title": "SASS/SCSS",
  "card.sql.content": "Znam totalne podstawy",
  "card.sql.description": "Strukturalny język zapytań używany do tworzenia, modyfikowania baz danych oraz do umieszczania i pobierania danych z baz danych",
  "card.sql.title": "SQL",
  "card.typeScript.content": "Mój ulubiony feature JS, typuję, tworzę interfacy, deklaruje typy gdzię tylko się da i nienawidzę typu 'any', wszystko po do, żeby kod był samo dokumentujący się i klarowny.",
  "card.typeScript.description": "Umożliwia on opcjonalne statyczne typowanie",
  "card.typeScript.title": "TypeScript",
  "card.vue.content": "Vue.js stosowałem do jednego nimi projektu z wykorzystaniem CLI oraz w pary mniejszych z wykorzystaniem CDN. Podoba mi się tam mix Angulara i Reacta",
  "card.vue.description": "Framework JavaScriptu służący do budowania interfejsów użytkownika",
  "card.vue.title": "Vue.js",
  "card.webpack.content": "Z projektu na projekt każda konfiguracja idzie mi coraz szybciej, chociaż i tak muszę szukać wszystkiego po dokumentacjach.",
  "card.webpack.description": "Jest to pakiet modułów głównie dla JavaScript",
  "card.webpack.title": "Webpack",
  "common.subpage.under.construction": "Podstrona w budowie",
  "common.to.now": " do teraz",
  "experience.content": "Pentacomp Systemy informatyczne S.A.",
  "footer": "Stworzona przez ",
  "home.sub.title": "Jestem front-end developerem w Escola Sp. z o.o",
  "home.title": "Cześć, jestem Przemek",
  "nav.contact": "Kontakt",
  "nav.experience": "Doświadczenie",
  "nav.home": "Strona główna",
  "nav.progress": "Mój postęp",
  "nav.projects": "Projekty",
  "progress.1": "Moja pierwsza styczność z front-endem",
  "progress.2": "Pierwsze kroki w HTML5 i CSS3",
  "progress.3": "Moje Pierwsze mini projekty z wykorzystaniem HTML5 i CSS3",
  "progress.4": "Pierwsze kroki we frameworku CSSa - Bootstrap",
  "progress.5": "Kurs zorganizowany przez ALX: \"Tworzenie stron WWW\", gdzie rozwinołem swoję umiejętności z HTML5, CSS3, Bootstrap, oraz poznałem podstawy JavaScriptu oraz Responsive Web Design",
  "progress.6": "Zaczynam uczyć się z kursów online, takich jak codeacademy",
  "progress.7": "Pierwsze kroki w jQuery",
  "progress.8": "Zaczynam tworzyć bardziej zaawanstowany mini projekty z wykorzystaniem HTML5, CSS3, RWD, jQuery",
  "progress.9": "Bootcamp Kodilla, gdzie rozwijam swoje dotychczasowe umiejęctości oraz poznaję SASS/SCSS, Git i bardziej zaawansowany JavaScript. W trakcie kursu tworzę około 10 mini projektów Photoshop => HTML, wszystkie te projekty są w pełni responsywne",
  "progress.10": "Zaczynam szykać pracy jako front-end developer",
  "progress.11": "Zaczynam eksperymentować z frameworkami JavaScript: React.js oraz Angular.js, jednak nie idzie mi najlepiej i postanawiam, skupić się na poprawieniu umiejtności w czystym JavaScripcie",
  "progress.12": "Skupiając się na JavaScripcie rozwiązuje dziesiątki jak nie setki mniejszych i większych zadań portalu codewars",
  "progress.13": "Podczas rozwiązywania zadań za Codewars zaczynam wykorzystywać składnie ES6",
  "progress.14": "Mój pierwszy mini projekt komercyjny tzw \"landing page\"",
  "progress.15": "Kupuję swoje pierwsze kursy w serwisię Udemy (z czasem będzie ich dość sporo)",
  "progress.16": "Odbywam sporo rozmów kwalifikacyjnych",
  "progress.17": "Odbywam rozmowę kwalifikacyjna w firmie Pentacomp Systemy Informatyczne S.A.",
  "progress.18": "Dostaję informację zwrotną z Pentacomp, że pozytywnie przeszedłem proces rekrutacji i po dogadaniu warunków umowy zgadzam się na nawiązanie współpracy jak Front-end developer",
  "progress.19": "Mój pierwszy dzień w Pentacompie",
  "progress.20": "Dołączam do zespołu Java, który niedawno zaczoł realizować projekt dla Banku BGŻ BNP Paribas pod nazwą ILegal, zapewniająca workflow dla prawników banku. Moim głównym zadaniem jest stylizacją projektu.",
  "progress.21": "Jestem wspólrealizotorem prezentacji pt: 'Angular vs React vs Vue', moją część to opracowanie części Angular i Vue",
  "progress.22": "Razem z zespołęm dołączamy do innego zespołu i wspólnie realizujemy projekt LIMS. Aplikacja ta ma zapewniać workflow pracownikom GIOŚ w kwestii badania próbek wody. Wykorzystuję ona takie technologie front-endowe jak React.js i TypeScript",
  "progress.23": "TypeScript staję się moją ulubioną cechą JavaScriptu",
  "progress.24": "Zaczynam pisać pierwsze funkcjonalności w Java i skrypty w Liquibase",
  "progress.25": "Razem z zespołem zaczynamy realizację projektu Portalu Jakości Wód Powierzchniowych. Ma to być aplikacja ogólno dostępna i ma zawierać publikację GIOŚ o jakości wód w Polsce. W aplikacji zastosowanę zostaną technologię front-endowe takie jak React.js, TypeScript i React-Native.",
  "progress.26": "Poznaję React Hooks, w których widzę gigantyczny podencjał. Wiedzę propaguję również w zespole i wprowadzam zmiany w projekcie PJWP",
  "progress.27": "Poprawa błedów WCAG 2.0 po przeprowadzeniu audytu przez Fundację Widzialni dla projektu PJWP.",
  "progress.28": "Uzyskanie certyfikatu \"Strona bez barier\" od Fundacji Widzialni. Sprawia mi to ognomną satysfakcję, ponieważ jest to w 100% moje dzieło i uświadamia mnie, że na front-endzie jestem w stanie zrobić wszystko.",
  "progress.29": "Razem z zespołem zaczynamy realizację projektu SPWD MX - jest to sub moduł większego projektu dla Warszawskiej Straży Miejskiej mający na celu administrowanie i zbieranie informacji z pozostałych modułów. Jest również projekt w 100% wykorzystujący React Hooks",
  "progress.30": "Znacząco podnoszę swoję w TypeScripcie tworząc znacznie więcej Generycznie typowanych komponentów. Zaczynam również podnosić swoję umiejętności w JEST przy testach hooksów, jednak projekt nie zbyt krótki na dopracowanie swoich umiejętności",
  "progress.31": "Na czas skupienia się przez mój zespół na projektach typowo back-endowych, zostaję wypożyczony do innego zespołu, aby dostosować projekt SPWD - Portal Mieszkańca do wymagań WCAG",
  "progress.32": "Razem z zespołem przejmujemy działający produkcyjnie projekt dla Uczelni Leona Koźmiśkiego, ALK - Wnioski.",
  "progress.33": "Z racji tego, że aplikacja ALK - Wnioski, jest dość skomplikowaną aplikacją i w dodatku nie podasia TypeScrita, forsuję pomysł w zespole na zmianę konfiguracji oraz przepisanie głównych komponentów z JavaScripta na TypeScript",
  "progress.34": "Realizacja zapotrzebowanie klienta na rozwój aplikacji ALK",
  "progress.35": "Realizacja 3 paczek aktualizacji dla klienta BNP Paribas dla aplikacji Ilegal",
  "progress.36": "Z racji tego że aplikacja Ilegal jest aplikacją typowo back-endową, a w tym czasię nie ma dla mnie innych zleceń z front-endu, zaczynam pisać kod w 100% w Javie ",
  "progress.37": "Znacznie poprawiam swoje umiejętności pisania i odczytywania kodu w Javie",
  "progress.38": "Tworze na potrzeby prezentacji \"Zmokowaną\" aplikację mobilną dla klienta BPN Paribas. Jest to aplikacja webowa z rozdzielczością dostosowaną do 360px szerokości. W przeciągu 5 dni roboczych udaje mi się stworzyć widoki: logowania z różnego typu użytkownikami, lista spraw dla prawników z filtrowaniem, oraz ekran tworzenia i edytowania sprawy.",
  "progress.39": "Realizacja zapotrzebowanie klienta na rozwój aplikacji Ilegal",
  "progress.40": "Realizacja zapotrzebowanie klienta na rozwój aplikacji ALK - stworzenie dodatkowych 5 wnioskow",
  "progress.41": "Realizacja zapotrzebowanie klienta na rozwój aplikacji Ilegal - integracja z systemem zewnętrznym",
  "progress.42": "Realizacja zapotrzebowanie klienta na rozwój aplikacji Ilegal - rozbudowa systemu o nowy moduł do obsługi podpisów elektronicznych",
  "progress.43": "Zmieniam miejsce pracy na firmę Escola. Sp z o.o. po czterach latach pracy w Pentacompie",
  "progress.44": "Realizacja projektu \"Pupile\" - projekt mający podobne założenia co \"ZnanyLekarz\" tylko dla zwierząt",
  "progress.45": "Realizacja projektu \"LMS\" - stworzenie biblioteki komponentów na dalsze potrzeby firmy",
  "progress.46": "Realizacja projektów dla firm \"Wealthon\", są to 3 większe projekty front-endowe i 2 mniejsze, aplikacja służy do udzielania pożyczek",
  "progress.47": "Realizacja projektu \"Omana\", dla zagranicznego klienta, aplikacja ma na celu tworzenie meetingów z dodatkowymi opcjami których wymaga klient",
  "projects.card.image.alt.creative.project": "Creative Project, PSD => HTML",
  "projects.card.image.alt.game": "Gra master mind",
  "projects.card.image.alt.hex.project": "Hex Project, PSD => HTML",
  "projects.card.image.alt.mobile.ninja": "Mobile Ninja, PSD => HTML",
  "projects.card.image.alt.photoapp": "Photo App, PSD => HTML",
  "projects.card.image.binary-clock": "Zegar binarny",
  "projects.card.image.ilegal": "I-legal dla prawników BNP Paribas",
  "projects.card.image.lims": "Lims dla GIOŚ",
  "projects.card.image.pjwp": "PJWP dla GIOŚ",
  "projects.card.image.semaphore": "Sygnalizacja kolejowa w Polsce",
  "projects.card.image.todo-list-angular": "Todo Lista Angular 4",
  "projects.card.image.todo-list-vue": "Todo Lista Vue.js",
  "projects.card.image.zpwd-mx": "ZPWD-MX dla Warszawskiej straży miejskiej",
  "projects.card.link.full.code": "Zobacz kod",
  "projects.card.link.live": "Zobacz strone",
  "projects.card.technology.binary-clock": "HTML5 | CSS3 | JavaScript | ES6",
  "projects.card.technology.creative.project": "HTML5 | SCSS | CSS3 | Bootstrap | RWD | JavaScript | jQuery | NPM",
  "projects.card.technology.game": "HTML5 | CSS3 | SCSS | Bootstrap | RWD | Javascript | jQuery | NPM",
  "projects.card.technology.hex.project": "HTML5 | CSS3 | Bootstrap | RWD | jQuery",
  "projects.card.technology.ilegal": "HTML5 | SCSS | JavaScript | jQuery | Bootstrap | RWD | Java | Thymeleaf | SQL | Liquibase | Docker | Maven",
  "projects.card.technology.lims": "HTML5 | SCSS | JavaScript | ES6 | React.js | TypeScript | Antd | RWD | Java | SQL | Liquibase | Maven",
  "projects.card.technology.mobile.ninja": "html5 | CSS3 | FLEXBOX | Bootstrap | RWD | Javascript | jQuery | NPM",
  "projects.card.technology.photoapp": "HTML5 | SCSS | CSS3 | Bootstrap | RWD | NPM",
  "projects.card.technology.pjwp": "HTML5 | SCSS | JavaScript | ES6 | React.js | React Hooks | TypeScript | JEST | Antd | RWD | WCAG 2.0 | Java | SQL | Liquibase | Gradle",
  "projects.card.technology.semaphore": "HTML5 | Vue.js |        SCSS | Bootstrap | RWD | Javascript | NPM | Grunt",
  "projects.card.technology.todo-list-angular": "HTML5 | Angular 4 | TypeScript | SCSS | Bootstrap | RWD | Javascript | NPM | Webpack",
  "projects.card.technology.todo-list-vue": "HTML5 | Vue.js | Vue Cli | SCSS | Bootstrap | RWD | Javascript | NPM | Webpack",
  "projects.card.technology.zpwd-mx": "HTML5 | SCSS | JavaScript | ES6 | React.js | React Hooks | TypeScript | JEST | Antd | RWD | Java | SQL | Liquibase | Docker | Maven",
  "projects.card.title.technology": "Technologie",
  "projects.header.not.publicly.avaible": "Projekty komercyjne publicznie niedostępne",
  "projects.header.private.projects": "Projekty prywatne",
  "projects.header.publicly.avaible": "Projekty komercyjne publiczno-dostępne",
  "title.experience": "Doświadczenie zawodowe",
  "title.technologies": "Znane technologie / biblioteki",
  "title.technologies.beginner": "Podstawowa znajomość technologii / bibliotek"
}
